In [1]:
import numpy as np
import pandas as pd

In [3]:
np.random.seed(101)
df = pd.DataFrame(data= np.random.randn(6, 5), index="A B C D E F".split(" "), columns="VAL1 VAL2 VAL3 VAL4 VAL5".split())

In [4]:
df.head()

       VAL1      VAL2      VAL3      VAL4      VAL5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [5]:
df["VAL1"]

A    2.706850
B   -0.319318
C    0.528813
D    0.955057
E    0.302665
F    0.390528
Name: VAL1, dtype: float64

In [10]:
type(df["VAL1"])

pandas.core.series.Series

In [6]:
df["VAL1"].values

array([ 2.70684984, -0.31931804,  0.52881349,  0.95505651,  0.30266545,
        0.39052784])

In [9]:
type(df["VAL1"].values)

numpy.ndarray

In [7]:
df[["VAL1"]]

       VAL1
A  2.706850
B -0.319318
C  0.528813
D  0.955057
E  0.302665
F  0.390528

In [8]:
type(df[["VAL1"]])

pandas.core.frame.DataFrame

In [11]:
df[["VAL1"]]["B": "D"]

       VAL1
B -0.319318
C  0.528813
D  0.955057

In [12]:
df[["VAL1"]][1: 4]

       VAL1
B -0.319318
C  0.528813
D  0.955057

In [13]:
# selecting some values

In [14]:
df[["VAL1", "VAL2", "VAL3"]]

       VAL1      VAL2      VAL3
A  2.706850  0.628133  0.907969
B -0.319318 -0.848077  0.605965
C  0.528813 -0.589001  0.188695
D  0.955057  0.190794  1.978757
E  0.302665  1.693723 -1.706086
F  0.390528  0.166905  0.184502

In [15]:
# slicing

In [16]:
df["B": "D"]

       VAL1      VAL2      VAL3      VAL4      VAL5
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [20]:
df["E": "E"]

       VAL1      VAL2      VAL3      VAL4      VAL5
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [21]:
df["E": "E"][["VAL1", "VAL2"]]

       VAL1      VAL2
E  0.302665  1.693723